# RT-DETR with MobileNet Backbone

nc: 80  # Number of classes

scales:  # Model compound scaling constants
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileNetLayer, [32, 1, 2]]   # First layer, similar to ResNetLayer 0
  - [-1, 1, MobileNetLayer, [16, 1, 1]]   # Similar to ResNetLayer 1
  - [-1, 1, MobileNetLayer, [24, 2, 2]]   # Similar to ResNetLayer 2
  - [-1, 1, MobileNetLayer, [32, 3, 2]]   # Similar to ResNetLayer 3
  - [-1, 1, MobileNetLayer, [64, 4, 2]]   # Similar to ResNetLayer 4
  - [-1, 1, MobileNetLayer, [96, 3, 1]]   # Additional MobileNet layers
  - [-1, 1, MobileNetLayer, [160, 3, 2]]  # Additional MobileNet layers
  - [-1, 1, MobileNetLayer, [320, 1, 1]]  # Additional MobileNet layers

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # Head layers remain unchanged
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # Adjust the index if needed
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]  # Cat backbone P4
  - [-1, 3, RepC3, [256]]  # X3 (16), fpn_blocks.1
  - [-1, 1, Conv, [256, 3, 2]]  # 17, downsample_convs.0
  - [[-1, 12], 1, Concat, [1]]  # Cat Y4
  - [-1, 3, RepC3, [256]]  # F4 (19), pan_blocks.0
  - [-1, 1, Conv, [256, 3, 2]]  # 20, downsample_convs.1
  - [[-1, 7], 1, Concat, [1]]  # Cat Y5
  - [-1, 3, RepC3, [256]]  # F5 (22), pan_blocks.1
  - [[16, 19, 22], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)
