# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-MobileNet object detection model with P3-P5 outputs.

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# Backbone Configuration (MobileNet layers with P3-P5 outputs)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileNetLayer, [3, 64, 1, True, 1]]  # Layer 0: Initial MobileNet Layer
  - [-1, 1, MobileNetLayer, [64, 64, 1, False, 3]]  # Layer 1
  - [-1, 1, MobileNetLayer, [256, 128, 2, False, 4]]  # Layer 2
  - [-1, 1, MobileNetLayer, [512, 256, 2, False, 6]]  # Layer 3
  - [-1, 1, MobileNetLayer, [1024, 512, 2, False, 3]]  # Layer 4

# Head Configuration (for prediction and detection)
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # Layer 5: Initial convolution
  - [-1, 1, AIFI, [1024, 8]]  # Layer 6: Attention-based mechanism (AIFI)
  - [-1, 1, Conv, [256, 1, 1]]  # Layer 7: Post-AIFI convolution

  # Upsample process for feature map fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P5
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # Layer 9: Match P4 dimensions
  - [[-2, -1], 1, Concat, [1]]  # Concatenate P5 with P4
  - [-1, 3, RepC3, [256]]  # Layer 11: RepC3 block for feature processing
  - [-1, 1, Conv, [256, 1, 1]]  # Layer 12: Convolution for channel reduction

  # Second upsampling stage
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P4
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # Layer 14: Match P3 dimensions
  - [[-2, -1], 1, Concat, [1]]  # Concatenate P4 with P3
  - [-1, 3, RepC3, [256]]  # Layer 16: RepC3 block for feature fusion (FPN block)

  # Downsampling stages
  - [-1, 1, Conv, [256, 3, 2]]  # Layer 17: Downsample from P3 to P4
  - [[-1, 12], 1, Concat, [1]]  # Concatenate downsampled P3 with P4
  - [-1, 3, RepC3, [256]]  # Layer 19: PAN block for feature enhancement

  - [-1, 1, Conv, [256, 3, 2]]  # Layer 20: Downsample from P4 to P5
  - [[-1, 7], 1, Concat, [1]]  # Concatenate downsampled P4 with P5
  - [-1, 3, RepC3, [256]]  # Layer 22: PAN block for feature enhancement

  # Detection head with P3, P4, P5 outputs
  - [[16, 19, 22], 1, RTDETRDecoder, [nc]]  # Detect objects from P3, P4, and P5 layers
